Revit 2027 API
ParameterTypeId.Use3dSnapping Property
 "3D Snapping"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Use3dSnapping { get; }
Public Shared ReadOnly Property Use3dSnapping As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Use3dSnapping {
	ForgeTypeId^ get ();
}
static member Use3dSnapping : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace